# Question 1

#### a.

In [69]:
import pandas as pd
import random as rd
randdf= pd.DataFrame({'A':['a','b','c','d','e'],'B':[9,8,7,6,5],'C':['h','i','j','k','l']}, index=[0,1,2,3,4])
randdf

   A  B  C
0  a  9  h
1  b  8  i
2  c  7  j
3  d  6  k
4  e  5  l

In [70]:
def sample_wo_rep(data, n=None):
    if n is not None and not isinstance(n, int):
        raise TypeError('number of samples has to be int or None')
    samples = []
    stacked = data.stack()  #turn my dataframe into a series so I can create a list for sample to work on
    datalist = stacked.values.tolist()
    randlen = len(datalist)
    if n is None:
        rng = rd.randint(1, randlen)
        samples += rd.sample(datalist, rng)
    if isinstance(n, int):
        samples += rd.sample(datalist, n)
    return samples
sampleddf = sample_wo_rep(randdf)
sampleddf

[9, 'c', 'h', 8, 'b']

#### b.

In [71]:
cars = pd.DataFrame({'cars':['Fiat 500','Toyota Supra','Volkswagon Golf','Nissan GTR','Lamborghini Aventador','Nissan Quest','Toyota Prius','Rolls Royce Phantom', 
        'Smart Car','Volkswagon Beetle','Honda Accord','Toyota Tacoma','Subaru Outback','Ford Fiesta','Nissan Cube','Kia Soul','Toyota Camry',
        'Oscar Mayer Weinermobile']})

len(cars)

18

In [72]:
df1 = pd.DataFrame({'Name':sample_wo_rep(cars, 10),'MPG':rd.sample(range(5,50), 10)})
df1

                Name  MPG
0       Toyota Supra   37
1           Fiat 500   20
2  Volkswagon Beetle   46
3           Kia Soul   44
4       Toyota Camry   11
5       Nissan Quest   48
6     Subaru Outback    6
7          Smart Car   27
8       Toyota Prius    7
9         Nissan GTR   47

In [73]:
df2 = pd.DataFrame({'Name':sample_wo_rep(cars, 10),'SecondsTo60':rd.sample(range(1,20), 10)})
df2

                       Name  SecondsTo60
0  Oscar Mayer Weinermobile            4
1              Toyota Supra           17
2             Toyota Tacoma           15
3              Toyota Camry           16
4               Nissan Cube            2
5              Toyota Prius           11
6                Nissan GTR            5
7              Honda Accord            3
8            Subaru Outback            8
9                  Kia Soul           12

#### c.

In [74]:
df = df1.merge(df2, on='Name', how='outer')
df

                        Name   MPG  SecondsTo60
0               Toyota Supra  37.0         17.0
1                   Fiat 500  20.0          NaN
2          Volkswagon Beetle  46.0          NaN
3                   Kia Soul  44.0         12.0
4               Toyota Camry  11.0         16.0
5               Nissan Quest  48.0          NaN
6             Subaru Outback   6.0          8.0
7                  Smart Car  27.0          NaN
8               Toyota Prius   7.0         11.0
9                 Nissan GTR  47.0          5.0
10  Oscar Mayer Weinermobile   NaN          4.0
11             Toyota Tacoma   NaN         15.0
12               Nissan Cube   NaN          2.0
13              Honda Accord   NaN          3.0

#### d.

In [75]:
df['MPG']=df['MPG'].fillna(value=df['MPG'].mean())
df['SecondsTo60']=df['SecondsTo60'].fillna(value=df['SecondsTo60'].max())
df

                        Name   MPG  SecondsTo60
0               Toyota Supra  37.0         17.0
1                   Fiat 500  20.0         17.0
2          Volkswagon Beetle  46.0         17.0
3                   Kia Soul  44.0         12.0
4               Toyota Camry  11.0         16.0
5               Nissan Quest  48.0         17.0
6             Subaru Outback   6.0          8.0
7                  Smart Car  27.0         17.0
8               Toyota Prius   7.0         11.0
9                 Nissan GTR  47.0          5.0
10  Oscar Mayer Weinermobile  29.3          4.0
11             Toyota Tacoma  29.3         15.0
12               Nissan Cube  29.3          2.0
13              Honda Accord  29.3          3.0

#### e.

In [76]:
df['Name'] = 'Awesome ' + df['Name']
df

                                Name   MPG  SecondsTo60
0               Awesome Toyota Supra  37.0         17.0
1                   Awesome Fiat 500  20.0         17.0
2          Awesome Volkswagon Beetle  46.0         17.0
3                   Awesome Kia Soul  44.0         12.0
4               Awesome Toyota Camry  11.0         16.0
5               Awesome Nissan Quest  48.0         17.0
6             Awesome Subaru Outback   6.0          8.0
7                  Awesome Smart Car  27.0         17.0
8               Awesome Toyota Prius   7.0         11.0
9                 Awesome Nissan GTR  47.0          5.0
10  Awesome Oscar Mayer Weinermobile  29.3          4.0
11             Awesome Toyota Tacoma  29.3         15.0
12               Awesome Nissan Cube  29.3          2.0
13              Awesome Honda Accord  29.3          3.0

#### f.

In [77]:
df_eco = df[df['MPG'] > df['MPG'].median()]
df_eco

                        Name   MPG  SecondsTo60
0       Awesome Toyota Supra  37.0         17.0
2  Awesome Volkswagon Beetle  46.0         17.0
3           Awesome Kia Soul  44.0         12.0
5       Awesome Nissan Quest  48.0         17.0
9         Awesome Nissan GTR  47.0          5.0

# Question 2

In [43]:
import pandas as pd
import numpy as np
ingredientsdf = pd.read_csv('ingredientslist.csv')
ingredients = ingredientsdf.iloc[0].to_list()

ingredients

[57.5, 112.5, 245.0]

In [44]:
goods = pd.read_csv('goodslist.csv')
goods

              Name  Price  Yeast  Flour  Sugar
0        Apple Pie   2.99   0.00   0.75   1.50
1        Croissant   2.50   0.50   1.50   0.25
2  Poppy seed roll   5.99   1.15   1.50   0.75

In [74]:
cost = goods['Price'].to_list()
minus = -1
cost = [minus * i for i in cost] #linprog by default minimizes the solution, but since I want the maximum solution I should make my equation negative
cost

[-2.99, -2.5, -5.99]

In [75]:
A_ub = np.array([[0., .5, 1.15],[.75,1.5,1.5],[1.5,.25,.75]])
b_ub = ingredients
A_ub, b_ub

(array([[0.  , 0.5 , 1.15],
        [0.75, 1.5 , 1.5 ],
        [1.5 , 0.25, 0.75]]),
 [57.5, 112.5, 245.0])

In [76]:
bounds = [(0, None) for i in range(3)]
bounds

[(0, None), (0, None), (0, None)]

In [82]:
from scipy.optimize import linprog
solution = linprog(cost, A_ub=A_ub, b_ub=b_ub, bounds=bounds)
print('status =',solution.status,'iters =',solution.nit,'profit =',-solution.fun,'\nx=\n',solution.x)

status = 0 iters = 2 profit = 449.0
x=
 [50.  0. 50.]

In [85]:
print('The max profit is',-solution.fun,'and can be achieved by producing:\n* Apple Pie:',solution.x[0],'pieces\n* Poppy seed roll:',\
      solution.x[2],'pieces'
     )

The max profit is 449.0 and can be achieved by producing:
* Apple Pie: 50.00000000000001 pieces
* Poppy seed roll: 50.0 pieces

This code was inspired by an article linked below, which walked me through a linear programming minimization problem. I followed the blueprint given there, except flipping the signs of all the values since I was doing a maximization problem instead. To find this solution, I had to set up the problem as a system of equations. The linear objective function that I wanted to maximize was given by the prices of each of the pastries, which had to be multiplied by -1 since I was doing a maximization. I then wrote out a system of linear equations that represented the amount of each ingredient that each pastry required, along with the maximum amount of each ingredient used. There were 3 equations, representing each ingredient, shown by the coefficients in the matrix A_ub. The constraint vector is shown by the vector b_ub. Then, I passed all this to the linprog function to get my maximum profit and the amount of each pastry that would be made.

article used linked here: https://www.educative.io/answers/what-is-optimizelinprog-in-scipy